# 2_3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

enter_monts = input("Введите месяц (1 - 12): ")

# через dict
dict_monts = {
    "1": "январь",
    "2": "февраль",
    "3": "март",
    "4": "апрель",
    "5": "май",
    "6": "июнь",
    "7": "июль",
    "8": "август",
    "9": "сентябрь",
    "10": "октябрь",
    "11": "ноябрь",
    "12": "декабрь",
}

dict_time_year = {
    "1": "зима",
    "2": "зима",
    "3": "весна",
    "4": "весна",
    "5": "весна",
    "6": "лето",
    "7": "лето",
    "8": "лето",
    "9": "осень",
    "10": "осень",
    "11": "осень",
    "12": "зима",
}

print(f"месяц {dict_monts.get(enter_monts)}, время года {dict_time_year.get(enter_monts)}")

# через list
list_monts = [["1", "январь - зима"], ["2", "февраль - зима"], ["3", "март - весна"],
              ["4", "апрель - весна"], ["5", "май - весна"], ["6", "июнь - лето"],
              ["7", "июль - лето"], ["8", "август - лето"], ["9", "сентябрь - осень"],
              ["10", "октябрь - осень"], ["11", "ноябьрь - осень"], ["12", "декабрь - зима"]]

for i in list_monts:
    number_m = i[0]
    if enter_monts == number_m:
        print(i[1])
        break
